# KeynoteText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..KeynoteText Property
ParameterTypeId Class See Also
---
"Keynote Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId KeynoteText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeynoteText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KeynoteText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace